---
type: SpacingRule
namespace: Autodesk.Revit.DB
version: 2024
members: 13
tags: [revit-api, class]
---

# SpacingRule

`Autodesk.Revit.DB.SpacingRule` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | SetLayoutFixedDistance | — | `public void SetLayoutFixedDistance ( double distance , SpacingRuleJustification just , double gridlinesRotation , double offset )` |
| Method | SetLayoutFixedNumber | — | `public void SetLayoutFixedNumber ( int number , SpacingRuleJustification just , double gridlinesRotation , double offset )` |
| Method | SetLayoutMaximumSpacing | — | `public void SetLayoutMaximumSpacing ( double distance , SpacingRuleJustification just , double gridlinesRotation , double offset )` |
| Method | SetLayoutMinimumSpacing | — | `public void SetLayoutMinimumSpacing ( double distance , SpacingRuleJustification just , double gridlinesRotation , double offset )` |
| Method | SetLayoutNone | — | `public void SetLayoutNone ()` |
| Property | BeltMeasurement | — | `public double BeltMeasurement { get ; set ; }` |
| Property | Distance | — | `public double Distance { get ; set ; }` |
| Property | GridlinesRotation | — | `public double GridlinesRotation { get ; set ; }` |
| Property | HasBeltMeasurement | — | `public bool HasBeltMeasurement { get ; }` |
| Property | Justification | — | `public SpacingRuleJustification Justification { get ; set ; }` |
| Property | Layout | — | `public SpacingRuleLayout Layout { get ; }` |
| Property | Number | — | `public int Number { get ; set ; }` |
| Property | Offset | — | `public double Offset { get ; set ; }` |